app/views/evaluations/index.html.erb

SELECT "students".* FROM "students"
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <td><%= evaluation.project.projectName%>
            <td><%= evaluation.student_group.group_name %></td>
            <td><%= Student.find(evaluation.comment_student).firstN %> <%= Student.find(evaluation.comment_student).lastN %></td>

SELECT "students".* FROM "students"
---
    <tbody>
    <% Student.all.select{|s| s.student_group.group_name == @student.student_group.group_name && s.id != @student.id }.each do |student|%>