app/views/evaluations/show.html.erb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Peer Evaluation for:</strong>
  <%= Student.find(@evaluation.comment_student).firstN %> <%= Student.find(@evaluation.comment_student).lastN %>