app/views/home_page/evaluation.html.erb

SELECT "evaluations".* FROM "evaluations"
---
  <tbody>
  <% Evaluation.all.each do |evaluation| %>

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= evaluation.student_group.group_name %></td>
        <td><%= Student.find(evaluation.student_id).firstN %> <%= Student.find(evaluation.student_id).lastN %></td>
        <td><%= Student.find(evaluation.comment_student).firstN %> <%= Student.find(evaluation.comment_student).lastN %></td>