app/views/students/index.html.erb

        <td><%= student.dotNum %></td>
        <td><%= StudentGroup.find(student.student_group_id).group_name %></td>
---
SELECT "student_groups".* FROM "student_groups" WHERE "student_groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]