app/views/students/show.html.erb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "student_groups".* FROM "student_groups" WHERE "student_groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Group:</strong>
  <%= StudentGroup.find(@student.student_group_id).group_name %>