app/controllers/evaluations_controller.rb

SELECT "evaluations".* FROM "evaluations"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def index
    @evaluations = Evaluation.all
    @user = User.find(session[:user_id])
    @student = Student.find_by_user_id(@user.id)

SELECT "projects".* FROM "projects"
SELECT "student_groups".* FROM "student_groups"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students"
---
  def new
    @evaluation = Evaluation.new
    @projects = Project.all
    @student_groups = StudentGroup.all
    @user = User.find(session[:user_id])
    @student = Student.find_by_user_id(@user.id)
    @students = Student.all

SELECT "projects".* FROM "projects"
SELECT "student_groups".* FROM "student_groups"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "students".* FROM "students"
---
  def edit
    @projects = Project.all
    @student_groups = StudentGroup.all
    @user = User.find(session[:user_id])
    @student = Student.find_by_user_id(@user.id)
    @students = Student.all

SELECT "projects".* FROM "projects"
SELECT "student_groups".* FROM "student_groups"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "students".* FROM "students"
INSERT INTO "evaluations" ("score", "comment", "created_at", "updated_at", "project_id", "student_group_id", "student_id", "comment_student") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @evaluation = Evaluation.new(evaluation_params)
    @projects = Project.all
    @student_groups = StudentGroup.all
    @user = User.find(session[:user_id])
    @student = Student.find_by_user_id(@user.id)
    @students = Student.all

    respond_to do |format|
      if @evaluation.save

SELECT "projects".* FROM "projects"
SELECT "student_groups".* FROM "student_groups"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students"
UPDATE "evaluations" SET "score" = ?, "comment" = ?, "updated_at" = ? WHERE "evaluations"."id" = ?  [["score", 0], ["comment", ""], ["updated_at", "2020-12-01 22:18:41.159812"], ["id", 1]]
---
  def update
    @projects = Project.all
    @student_groups = StudentGroup.all
    @user = User.find(session[:user_id])
    @student = Student.find_by_user_id(@user.id)
    @students = Student.all

    respond_to do |format|
      if @evaluation.update(evaluation_params)

DELETE FROM "evaluations" WHERE "evaluations"."id" = ?  [["id", 2]]
---
  def destroy
    @evaluation.destroy

SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_evaluation
      @evaluation = Evaluation.find(params[:id])