app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("projectName", "created_at", "updated_at") VALUES (?, ?, ?)  [["projectName", "Project1"], ["created_at", "2020-12-01 22:12:08.670211"], ["updated_at", "2020-12-01 22:12:08.670211"]]