app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "chen.8182@osu.edu"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email:login_params[:email])