app/controllers/students_controller.rb

  def new
    @student = Student.new
    @student_groups = StudentGroup.all
    @users = User.all
---
SELECT "student_groups".* FROM "student_groups"
SELECT "users".* FROM "users"

  def edit
    @student_groups = StudentGroup.all
    @users = User.all
---
SELECT "student_groups".* FROM "student_groups"
SELECT "users".* FROM "users"

  def create
    @student = Student.new(student_params)
    @student_groups = StudentGroup.all
    @users = User.all

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("firstN", "lastN", "dotNum", "created_at", "updated_at", "student_group_id", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update

    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "student_group_id" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["student_group_id", 2], ["updated_at", "2020-12-09 00:47:57.926358"], ["id", 3]]

  def destroy
    @student.destroy
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]