app/controllers/student_groups_controller.rb

  def index
    @student_groups = StudentGroup.all
---
SELECT "student_groups".* FROM "student_groups"

  def create
    @student_group = StudentGroup.new(student_group_params)

    respond_to do |format|
      if @student_group.save
---
INSERT INTO "student_groups" ("group_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["group_name", "Group1"], ["created_at", "2020-12-01 22:09:25.601271"], ["updated_at", "2020-12-01 22:09:25.601271"]]

    def set_student_group
      @student_group = StudentGroup.find(params[:id])
---
SELECT "student_groups".* FROM "student_groups" WHERE "student_groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]